Repository: z3cka/wysiwyg_imageupload
Catalog: translations/*.po
Languages: de, fr

source: Image style
de: Gestaltung
fr: Présentation

source: Define which CSS styles the user can chose when adding an image. Please do not define floating or size in that CSS classes, as this is handled seperately. You can give the style a descriptive name to make it easier to handle. The syntax is "Descriptive Name=imgupl_style_XYC,Other Descriptive name=imgupl_style_ZXC.." while imgupl_style_* is a css class
de: Definieren Sie, welche Gestaltungsmöglichkeiten der Benutzer zur Auswahl hat. Bitte achten Sie darauf, dass Sie weder floating noch größe festlegen, die wird seperat gemacht. Die Syntax ist "Descriptive Name=imgupl_style_XYC,Other Descriptive name=imgupl_style_ZXC.." wähere imgupl_style_* eine CSS Klasse ist.

source: Allowed presets
de: Erlaubte Presets

source: Only the selected presets are allowed to be chosen in the dialog
de: Nur die gewählten Presets sind im Dialog erlaubt und werden dort angezeigt

source: Select an image to upload first
de: Bitte zuerst ein Bild auswählen

source: Upload image
de: Bild hochladen
fr: Télécharger la photo

source: Could not set permissons on destination file: %file
de: Konnte Rechte für die Zieldatei :%file nicht setzen

source: Title
de: Titel
fr: Titre

source: Image alignment
de: Textfluss

source: Image is inline with the text (none)
de: Text unter/vor Bild (kein Textfluss)

source: Image on left, text on right
de: Bild links, Text rechts

source: Image on right, text on left
de: Bild rechts, Text links

source: Size
de: Größe
fr: Taille

source: None
de: Keine
fr: aucun/e

source: Style
de: Gestaltung
fr: Présentation

source: Select an image to upload
de: Wählen Sie ein Bild aus, das hochgeladen werden soll

source: Please wait...
de: Bitte warten..
fr: Veullez attendre ...

source: Update image
de: Bild aktualisieren
fr: Actualiser la photo

source: The image does not exist (!path)
de: Das Bild existiert nicht (!path)

source: WYSIWYG Image upload
de: WYSIWYG Bild hochladen
fr: WYSIWYG télécharger une photo

source: Configuration options for the WYSIWYG Image upload module
de: Konfiguration des WYSIWYG Bild-hochlad-Modules
fr: Options de configuration du module de téléchargement de photo WYSIWYG

source: Image upload dialog for the most WYSIWYG Editors
de: Dialog zum Bild-hochladen für die meisten WYSIWYG Editoren
fr: Dialogue de téléchargement de photo pour la plupart des éditeurs WYSIWYG

source: Choose a new image out of all your already uploaded ones
de: Wählen Sie ein neues Bild aus Ihren bereits vorhandenen Bilder aus

source: Max. Items Displayed
de: Maximale Anzahl an angezeigten Bildern

source: Define how many Images should be displayed inside the Browser
de: Legen Sie fest, wieviele Bilder maximal angezeigt werden sollen

source: New Image
de: Neues Bild

source: Go back to the upload form and upload a new image
de: Zurück zum Upload um ein neues Bild hochzuladen

source: Insert this image
de: Dieses Bild einfügen

source: Browser for the last x Images inserted by the User
de: Nach den letzen eingefügten Bildern suchen

source: Image uploading
de: Bild hochladen
fr: Télécharger une photo

source: Insert or update an embedded image
de: Fügen Sie ein Bild ein oder aktualisieren Sie dieses
fr: Insérez une photo ou actualisez celle-ci

source: Insert
de: Einfügen
fr: Insérer

source: Please select an image to upload first
de: Bitte wählen Sie zuvor ein Bild aus, das Sie hochladen wollen
fr: Veuillez d'abord choisir une photo que vous voulez télécharger

source: Cancel
de: Abbrechen
fr: Annuler

source: Update
de: Aktualisieren
fr: Mise-à-jour

source: Define which CSS styles the user can chose when adding an image. Please do not define floating or size in that CSS classes, as this is handled seperately. You can give the style a descriptive name to let it handle more easily. The syntax is "Descriptive Name=imgupl_style_XYC,Other Descriptive name=imgupl_style_ZXC.." while imgupl_style_* is a css class
fr: Définissez le choix de l'utilisateur de possibilités de présentation. Veuillez éviter toute définition de floating ou de taille dans les classes CSS, ceci sera traité séparément. Vous pouvez attribuer au style un nom descriptif afin de le traiter plus facilement. La sytaxe est "Descriptive Name=imgupl_style_XYC,Other Descriptive name=imgupl_style_ZXC.." en tenant compte que imgupl_style_* est une classe CSS.

source: Choose an image
fr: Choisissez une photo

source: Select a file to upload first
fr: Choisissez d'abord une photo devant être télécharger

source: Upload picture
fr: Télécharger la photo

source: Text floating
fr: Placement du texte

source: Below image (none)
fr: Sous la photo (ou sans texte)

source: Text right beside image
fr: Texte coulant à droite de la photo

source: Text left beside image
fr: Texte coulant à gauche de la photo

source: Loading...
fr: en train de télécharger...
